tap "homebrew/cask"
tap "homebrew/cask-versions"

# terminal fun
brew "tmux"
brew "vim"
brew "mosh"
brew "emacs"

# software engineering fun
brew "git"
brew "gh"
brew "glab"
brew "gitea"

brew "go"
brew "goreleaser"

brew "cmake"
brew "ninja"

brew "bazelisk"
cask "temurin"
brew "maven"
tap "buildpacks/tap"
brew "pack"

# k8s cattle not pets
brew "kind"
brew "k9s"
brew "k3d"
brew "jq"
brew "kubernetes-helm"
brew "krew"
brew "kubectx"
brew "cilium-cli"
brew "clusterctl"
brew "vcluster"

# ci/cd fun
brew "argo"
brew "buildkit"

# fun with gitops
brew "argocd"
brew "flux"

# fun with CSPs
brew "azure-cli"
cask "google-cloud-sdk"
brew "awscli"
brew "openshift-cli"

# fun with IaC
brew "terraform"
brew "pulumi"
brew "terragrunt"

# fun with PolicAsCode

# fun with embedded databases
brew "duckdb"
brew "dolt"

# 'vscode --install-extension'
vscode "GitHub.codespaces"